from time import sleep
# drink = {
#     "นมเย็น": 35,
#     "กาเเฟ": 40,
#     "น้ำอัดลม":15,
#     "ชาเย็น":25,
#     "ชานม":35
# }

# food = {
#     "ข้าวผัด": 50,
#     "ต้มยำ": 80,
#     "ข้าวยำ": 35,
#     "ไก่ย่าง": 10,
#     "ไส้กรอง": 10
# }
food = ["ข้าวผัด", "ต้มยำ", "ข้าวยำ", "ไก่ย่าง", "ไส้กรอง"]
drink = ["นมเย็น", "กาเเฟ", "น้ำอัดลม", "ชาเย็น", "ชานม"]
user_food = []

# print("\n")
# print("####################################")
# print("          โปรเเกรมสั่งสินค้า             ")
# print("  เลือกรายการที่ต้องการ หากต้องการอาหาร   ")
# print("           1.  อาหาร                 ")
# print("           2. เครื่องดื่ม                ")
# print("           3. จบรายการ               ")
# print("####################################")

while True:
    print("\n")
    print("####################################")
    print("          โปรเเกรมสั่งสินค้า             ")
    print("  เลือกรายการที่ต้องการ หากต้องการอาหาร   ")
    print("           1.  อาหาร                 ")
    print("           2. เครื่องดื่ม                ")
    print("           3. จบรายการ               ")
    print("####################################")


    Menu1 = input("โปรดเลือก รายการที่ต้องการ : ")

    if Menu1 ==  "1":
        for i in range(len(food)):
            # print(str(i) + ". " + data_base.food[i])
            print(str(i + 1) + '. ' + food[i])
        print("####################################")
        user = int(input("เลือกรายการที่ต้องการ : "))
        user_food.append(food[user - 1])
        print("คุณเลือกรายการ : {}".format(user_food))
        print("####################################")
    elif Menu1 ==  "2":
        for i in range(len(drink)):
            print(str(i + 1) + '. ' + drink[i])
    elif Menu1 == "3":
        break
print("จบโปรเเกรม")